Repository: TaufiqOf/ScratchShell
Catalog: ScratchShell/Resources/Langauge.*.resx
Languages: bn, es

# ContextMenu_Cut
source: Cut
bn: কাট
es: Cortar

# ContextMenu_Copy
source: Copy
bn: কপি
es: Copiar

# ContextMenu_Paste
source: Paste
bn: পেস্ট
es: Pegar

# ContextMenu_Rename
source: Rename
bn: নাম পরিবর্তন
es: Renombrar

# ContextMenu_Upload
source: Upload
bn: আপলোড
es: Subir

# ContextMenu_Download
source: Download
bn: ডাউনলোড
es: Descargar

# ContextMenu_NewFolder
source: New Folder
bn: নতুন ফোল্ডার
es: Nueva carpeta

# General_NotApplicable
source: N/A
bn: প্রযোজ্য নয়
es: N/D

# General_Folder
source: Folder
bn: ফোল্ডার
es: Carpeta

# General_File
source: File
bn: ফাইল
es: Archivo

# General_Save
source: Save
bn: সংরক্ষণ
es: Guardar

# General_Cancel
source: Cancel
bn: বাতিল
es: Cancelar

# General_Close
source: Close
bn: বন্ধ
es: Cerrar

# General_Login
source: Login
bn: লগইন
es: Iniciar sesión

# General_Register
source: Register
bn: নিবন্ধন
es: Registrarse

# General_Export
source: Export
bn: এক্সপোর্ট
es: Exportar

# General_Import
source: Import
bn: ইমপোর্ট
es: Importar

# General_Sync
source: Sync
bn: সিঙ্ক
es: Sincronizar

# General_Logout
source: Logout
bn: লগআউট
es: Cerrar sesión

# General_Edit
source: Edit
bn: সম্পাদনা
es: Editar

# General_Delete
source: Delete
bn: মুছে ফেলুন
es: Eliminar

# General_OK
source: OK
bn: ঠিক আছে
es: Aceptar

# General_Error
source: Error
bn: ত্রুটি

# General_Cancelled
source: Cancelled
bn: বাতিল করা হয়েছে
es: Cancelado

# General_Yes
source: Yes
bn: হ্যাঁ
es: Sí

# General_No
source: No
bn: না

# Connection_EstablishingConnection
source: Establishing connection to {0}...
bn: {0} এর সাথে সংযোগ স্থাপন করা হচ্ছে...
es: Estableciendo conexión con {0}...

# Connection_ConnectingTo
source: Connecting to {0}...
bn: {0} এর সাথে সংযোগ করা হচ্ছে...
es: Conectando a {0}...

# Connection_InitializingFileOps
source: Initializing file operations...
bn: ফাইল অপারেশন শুরু করা হচ্ছে...
es: Inicializando operaciones de archivos...

# Connection_SettingUpNavigation
source: Setting up navigation...
bn: নেভিগেশন সেটআপ করা হচ্ছে...
es: Configurando navegación...

# Connection_LoadingHomeDirectory
source: Loading home directory...
bn: হোম ডিরেক্টরি লোড করা হচ্ছে...
es: Cargando directorio principal...

source: Connection Failed
bn: সংযোগ ব্যর্থ
es: Conexión fallida

# Connection_Lost
source: Connection lost - attempting to reconnect...
bn: সংযোগ হারিয়ে গেছে - পুনরায় সংযোগ করার চেষ্টা করা হচ্ছে...
es: Conexión perdida - intentando reconectar...

# Connection_Reconnecting
source: Reconnecting to {0}...
bn: {0} এর সাথে পুনরায় সংযোগ করা হচ্ছে...
es: Reconectando a {0}...

# Connection_FailedTo
source: Failed to connect to {0}:{1}
bn: {0}:{1} এর সাথে সংযোগ করতে ব্যর্থ
es: Error al conectar con {0}:{1}

# Connection_AttemptingTo
source: Attempting to connect to {0} ({1}:{2})
bn: {0} ({1}:{2}) এর সাথে সংযোগ করার চেষ্টা করা হচ্ছে
es: Intentando conectar a {0} ({1}:{2})

# Connection_SuccessfullyConnected
source: Successfully connected and initialized for {0}
bn: {0} এর সাথে সফলভাবে সংযুক্ত এবং শুরু করা হয়েছে
es: Conexión e inicialización correctas para {0}

# Connection_SuccessfullyReconnected
source: Successfully reconnected to {0}
bn: {0} এর সাথে সফলভাবে পুনরায় সংযুক্ত হয়েছে
es: Reconectado correctamente a {0}

# Connection_HealthCheckFailed
source: Connection health check failed - connection appears to be lost
bn: সংযোগ স্বাস্থ্য পরীক্ষা ব্যর্থ - সংযোগ হারিয়ে গেছে বলে মনে হচ্ছে
es: La verificación de la conexión falló - parece haberse perdido

# Connection_ReconnectionFailed
source: Reconnection failed: {0}
bn: পুনরায় সংযোজন ব্যর্থ: {0}
es: Reconexión fallida: {0}

# Operation_Timeout
source: Operation timeout: {0}
bn: অপারেশন টাইমআউট: {0}
es: Tiempo de espera de la operación: {0}

# Operation_NetworkError
source: Network error: {0}
bn: নেটওয়ার্ক ত্রুটি: {0}
es: Error de red: {0}

# Operation_SSHConnectionError
source: SSH connection error: {0}
bn: SSH সংযোগ ত্রুটি: {0}
es: Error de conexión SSH: {0}

# Operation_ConnectionError
source: Connection error: {0}
bn: সংযোগ ত্রুটি: {0}
es: Error de conexión: {0}

# Operation_HealthCheckError
source: Error during connection health check
bn: সংযোগ স্বাস্থ্য পরীক্ষার সময় ত্রুটি
es: Error durante la verificación de la conexión

# Operation_ConnectionTimeoutDetected
source: Connection timeout detected: {0}
bn: সংযোগ টাইমআউট সনাক্ত: {0}
es: Tiempo de espera de la conexión detectado: {0}

source: Operation log panel opened
bn: অপারেশন লগ প্যানেল খোলা হয়েছে
es: Panel de registro de operaciones abierto

source: Operation log panel closed
bn: অপারেশন লগ প্যানেল বন্ধ হয়েছে
es: Panel de registro de operaciones cerrado

# Operation_EnteringFullscreen
source: Entering full screen mode
bn: পূর্ণ স্ক্রিন মোডে প্রবেশ করা হচ্ছে
es: Entrando en modo pantalla completa

# Operation_ExitingFullscreen
source: Exiting full screen mode
bn: পূর্ণ স্ক্রিন মোড থেকে বের হওয়া হচ্ছে
es: Saliendo del modo pantalla completa

# Operation_UIEnabled
source: User interface enabled - ready for file operations
bn: ব্যবহারকারী ইন্টারফেস সক্ষম - ফাইল অপারেশনের জন্য প্রস্তুত
es: Interfaz habilitada - lista para operaciones de archivos

# Operation_StartingCleanup
source: Starting cleanup and disconnection
bn: পরিষ্কার এবং অবজেক্ট বিচ্ছিন্নতা শুরু
es: Iniciando limpieza y desconexión

# Operation_CleanupCompleted
source: Cleanup completed successfully
bn: পরিষ্কার সফলভাবে সম্পন্ন
es: Limpieza completada correctamente

# Operation_ClosingCurrentTab
source: Closing current tab due to connection failure
bn: সংযোগ ব্যর্থতার কারণে বর্তমান ট্যাব বন্ধ করা হচ্ছে
es: Cerrando pestaña actual por fallo de conexión

# Navigation_NavigatingToParent
source: Navigating to parent directory: {0}
bn: প্যারেন্ট ডিরেক্টরিতে নেভিগেট করা হচ্ছে: {0}
es: Navegando al directorio padre: {0}

# Navigation_NavigatingToFolder
source: Navigating to folder: {0}
bn: ফোল্ডারে নেভিগেট করা হচ্ছে: {0}
es: Navegando a la carpeta: {0}

# Navigation_OpeningFile
source: Opening file: {0}
bn: ফাইল খোলা হচ্ছে: {0}
es: Abriendo archivo: {0}

# Navigation_MultiSelectOperation
source: Multi-select operation requested for {0} selected item(s)
bn: {0} টি নির্বাচিত আইটেমের জন্য মাল্টি-সিলেক্ট অপারেশন অনুরোধ করা হয়েছে
es: Operación múltiple solicitada para {0} elemento(s)

# Navigation_MultiSelectOperationFailed
source: Multi-select operation failed: No items selected
bn: মাল্টি-সিলেক্ট অপারেশন ব্যর্থ: কোন আইটেম নির্বাচিত নেই
es: Operación múltiple fallida: No hay elementos seleccionados

# Navigation_MultiSelectOperationFailedValid
source: Multi-select operation failed: No valid items selected
bn: মাল্টি-সিলেক্ট অপারেশন ব্যর্থ: কোন বৈধ আইটেম নির্বাচিত নেই
es: Operación múltiple fallida: No hay elementos válidos seleccionados

# Navigation_ErrorGettingParentPath
source: Error getting parent path for {0}
bn: {0} এর জন্য প্যারেন্ট পাথ পেতে ত্রুটি
es: Error obteniendo la ruta padre de {0}

# CloudSync_UserNotAuthenticated
source: User not authenticated
bn: ব্যবহারকারী প্রমাণীকৃত নন
es: Usuario no autenticado

# CloudSync_EncryptionKeysNotAvailable
source: Cloud encryption keys not available. Please re-enter your password to enable cloud sync.
bn: ক্লাউড এনক্রিপশন কী উপলব্ধ নেই। ক্লাউড সিঙ্ক সক্ষম করতে আপনার পাসওয়ার্ড পুনরায় লিখুন।
es: Claves de cifrado en la nube no disponibles. Reingrese su contraseña para habilitar la sincronización.

# CloudSync_EncryptionKeysNotAvailableLogin
source: Cloud encryption keys not available. Please login again to enable cloud sync.
bn: ক্লাউড এনক্রিপশন কী উপলব্ধ নেই। ক্লাউড সিঙ্ক সক্ষম করতে আবার লগইন করুন।
es: Claves de cifrado en la nube no disponibles. Inicie sesión de nuevo para habilitar la sincronización.

# CloudSync_SyncConflictDetected
source: Sync conflict detected
bn: সিঙ্ক কনফ্লিক্ট সনাক্ত করা হয়েছে
es: Conflicto de sincronización detectado

# CloudSync_SettingsSyncedToCloud
source: Settings synced to cloud successfully
bn: ক্লাউডে সেটিংস সফলভাবে সিঙ্ক হয়েছে
es: Configuraciones sincronizadas con la nube correctamente

# CloudSync_SyncFailed
source: Sync failed
bn: সিঙ্ক ব্যর্থ
es: Sincronización fallida

# CloudSync_SyncFailedWithStatus
source: Sync failed: {0}
bn: সিঙ্ক ব্যর্থ: {0}
es: Sincronización fallida: {0}

# CloudSync_SyncError
source: Sync error: {0}
bn: সিঙ্ক ত্রুটি: {0}
es: Error de sincronización: {0}

# CloudSync_NoCloudSettingsFound
source: No cloud settings found
bn: কোন ক্লাউড সেটিংস পাওয়া যায়নি
es: No se encontraron configuraciones en la nube

# CloudSync_LocalChangesDetected
source: Local changes detected. Resolve conflicts first.
bn: স্থানীয় পরিবর্তন সনাক্ত করা হয়েছে। প্রথমে কনফ্লিক্ট সমাধান করুন।
es: Cambios locales detectados. Resuelva los conflictos primero.

# CloudSync_SettingsDownloadedFromCloud
source: Settings downloaded from cloud successfully
bn: ক্লাউড থেকে সেটিংস সফলভাবে ডাউনলোড হয়েছে
es: Configuraciones descargadas de la nube correctamente

# CloudSync_FailedToGetCloudSettings
source: Failed to get cloud settings
bn: ক্লাউড সেটিংস পেতে ব্যর্থ
es: Error al obtener configuraciones de la nube

# CloudSync_DownloadFailed
source: Download failed: {0}
bn: ডাউনলোড ব্যর্থ: {0}
es: Descarga fallida: {0}

# CloudSync_DownloadError
source: Download error: {0}
bn: ডাউনলোড ত্রুটি: {0}
es: Error de descarga: {0}

# CloudSync_CustomSettingsNotProvided
source: Custom settings not provided
bn: কাস্টম সেটিংস প্রদান করা হয়নি
es: No se proporcionaron configuraciones personalizadas

# CloudSync_InvalidResolutionOption
source: Invalid resolution option
bn: অবৈধ সমাধান অপশন
es: Opción de resolución inválida

# CloudSync_ConflictResolutionError
source: Conflict resolution error: {0}
bn: কনফ্লিক্ট সমাধান ত্রুটি: {0}
es: Error al resolver conflicto: {0}

# CloudSync_CloudSettingsDeletedSuccessfully
source: Cloud settings deleted successfully
bn: ক্লাউড সেটিংস সফলভাবে মুছে ফেলা হয়েছে
es: Configuraciones en la nube eliminadas correctamente

# CloudSync_DeleteFailed
source: Delete failed: {0}
bn: মুছে ফেলা ব্যর্থ: {0}
es: Error al eliminar: {0}

# CloudSync_DeleteError
source: Delete error: {0}
bn: মুছে ফেলার ত্রুটি: {0}
es: Error de eliminación: {0}

# UI_Username
source: Username
bn: ব্যবহারকারীর নাম
es: Usuario

# UI_Password
source: Password
bn: পাসওয়ার্ড
es: Contraseña

# UI_Search
source: Search...
bn: অনুসন্ধান...
es: Buscar...

# UI_SelectAll
source: Select All
bn: সব নির্বাচন করুন
es: Seleccionar todo

source: Server Name
bn: সার্ভারের নাম
es: Nombre del servidor

# Server_Host
source: Host
bn: হোস্ট

# Server_Port
source: Port
bn: পোর্ট
es: Puerto

# Server_Protocol
source: Protocol
bn: প্রোটোকল
es: Protocolo

# Server_Title
source: Server
bn: সার্ভার
es: Servidor

# Server_PublicKey
source: Public Key
bn: পাবলিক কী
es: Clave pública

# Server_PrivateKey
source: Private Key
bn: প্রাইভেট কী
es: Clave privada

# Server_KeyFilePassword
source: Key File Password
bn: কী ফাইল পাসওয়ার্ড
es: Contraseña del archivo de clave

# Server_UseKeyFileAuth
source: Use Key File Authentication
bn: কী ফাইল প্রমাণীকরণ ব্যবহার করুন
es: Usar autenticación con archivo de claves

# Server_ValidationSummary
source: Please fix the following errors:
bn: নিম্নলিখিত ত্রুটিগুলি ঠিক করুন:
es: Corrija los siguientes errores:

source: Server Actions
bn: সার্ভার ক্রিয়া
es: Acciones del servidor

# Snippet_DeleteConfirmTitle
source: Delete this snippet?
bn: এই স্নিপেট মুছবেন?
es: ¿Eliminar este fragmento?

# Snippet_DeleteConfirmMessage
source: Are you sure you want to delete {0}?
bn: আপনি কি নিশ্চিত যে আপনি {0} মুছে ফেলতে চান?
es: ¿Seguro que desea eliminar {0}?

# Snippet_SystemSnippets
source: System Snippets ({0})
bn: সিস্টেম স্নিপেটস ({0})
es: Fragmentos del sistema ({0})

# Snippet_UserSnippets
source: User Snippets ({0})
bn: ব্যবহারকারী স্নিপেটস ({0})
es: Fragmentos del usuario ({0})

# FileOp_UploadFile
source: Upload File
bn: ফাইল আপলোড
es: Subir archivo

# FileOp_DownloadFile
source: Download File
bn: ফাইল ডাউনলোড
es: Descargar archivo

# FileOp_SelectDestinationFolder
source: Select destination folder for {0}
bn: {0} এর জন্য গন্তব্য ফোল্ডার নির্বাচন করুন
es: Seleccione carpeta de destino para {0}

# FileOp_DeleteConfirmTitle
source: Delete {0}?
bn: {0} মুছবেন?
es: ¿Eliminar {0}?

# FileOp_DeleteConfirmMessage
source: Are you sure you want to delete '{0}'? This action cannot be undone.
bn: আপনি কি নিশ্চিত যে আপনি '{0}' মুছে ফেলতে চান? এমন একটি কাজ যা পূর্বাবস্থায় ফেরানো যাবে না।
es: ¿Está seguro que desea eliminar '{0}'? Esta acción no se puede deshacer.

# FileOp_DeleteMultiConfirmTitle
source: Delete {0} items?
bn: {0} আইটেম মুছবেন?
es: ¿Eliminar {0} elementos?

# FileOp_DeleteMultiConfirmMessage
source: Are you sure you want to delete the following {0} item(s)? {1} This action cannot be undone.
bn: আপনি কি নিশ্চিত bahawa আপনিআপনি কি নিশ্চিত যে আপনি নিম্নলিখিত {0} আইটেম(গুলি) মুছে ফেলতে চান? {1} এমন একটি কাজ যা পূর্বাবস্থায় ফেরানো যাবে না।
es: ¿Está seguro que desea eliminar los siguientes {0} elemento(s)? {1} Esta acción no se puede deshacer.

# FileOp_DeleteMultiConfirmMessageMany
source: Are you sure you want to delete {0} selected items? {1}... and {2} more This action cannot be undone.
bn: আপনি কি নিশ্চিত যে আপনি {0} নির্বাচিত আইটেম মুছে ফেলতে চান? {1}... এবং আরো {2} টি এমন একটি কাজ যা পূর্বাবস্থায় ফেরানো যাবে না।
es: ¿Está seguro que desea eliminar {0} elementos seleccionados? {1}... y {2} más Esta acción no se deshacer.

# FileOp_UploadCancelledByUser
source: Upload cancelled by user
bn: ব্যবহারকারী কর্তৃক আপলোড বাতিল
es: Subida cancelada por el usuario

# FileOp_DownloadCancelledByUser
source: Download cancelled by user
bn: ব্যবহারকারী কর্তৃক ডাউনলোড বাতিল
es: Descarga cancelada por el usuario

# FileOp_OperationCancelled
source: Operation cancelled
bn: অপারেশন বাতিল
es: Operación cancelada

# FileOp_ClipboardEmpty
source: Clipboard is empty
bn: ক্লিপবোর্ড খালি
es: El portapapeles está vacío

# FileOp_NoFilesForUpload
source: No files provided for upload
bn: আপলোডের জন্য কোন ফাইল প্রদান করা হয়নি
es: No se proporcionaron archivos para subir

# FileOp_DragDropUploadInitiated
source: Drag and drop upload initiated for {0} item(s)
bn: {0} আইটেম(গুলি) এর জন্য ড্র্যাগ এবং ড্রপ আপলোড শুরু হয়েছে
es: Subida por arrastrar y soltar iniciada para {0} elemento(s)

# Tooltip_AddServer
source: Add a new server to your list
bn: আপনার তালিকায় একটি নতুন সার্ভার যোগ করুন
es: Agregar un nuevo servidor a la lista

# Tooltip_OpenTerminal
source: Open a new terminal session (choose mode)
bn: একটি নতুন টার্মিনাল সেশন খুলুন (মোড নির্বাচন করুন)
es: Abrir una nueva sesión de terminal (elegir modo)

# Tooltip_ExportServers
source: Export your server list to a file for backup or sharing
bn: ব্যাকআপ বা শেয়ারিংয়ের জন্য আপনার সার্ভার তালিকা একটি ফাইলে এক্সপোর্ট করুন
es: Exportar servidores a un archivo para copia o compartir

# Tooltip_ImportServers
source: Import servers from a file into your list
bn: একটি ফাইল থেকে আপনার তালিকায় সার্ভার ইমপোর্ট করুন
es: Importar servidores desde un archivo

# Tooltip_SearchServers
source: Search servers by name, host, or protocol
bn: নাম, হোস্ট, বা প্রোটোকল দ্বারা সার্ভার খুঁজুন
es: Buscar servidores por nombre, host o protocolo

# Tooltip_BrowseFile
source: Browse for file
bn: ফাইল ব্রাউজ করুন
es: Buscar archivo

# Tooltip_BrowsePublicKey
source: Browse for public key file
bn: পাবলিক কী ফাইল ব্রাউজ করুন
es: Buscar archivo de clave pública

# Tooltip_BrowsePrivateKey
source: Browse for private key file
bn: প্রাইভেট কী ফাইল ব্রাউজা করুন
es: Buscar archivo de clave privada

# Tooltip_BrowseExportLocation
source: Browse for export file location
bn: এক্সপোর্ট ফাইল অবস্থান ব্রাউজ করুন
es: Buscar ubicación de exportación

# Tooltip_CloseTab
source: Close tab
bn: ট্যাব বন্ধ করুন
es: Cerrar pestaña

# Placeholder_Username
source: Enter your username
bn: আপনার ব্যবহারকারীর নাম লিখুন
es: Ingrese su usuario

# Placeholder_Password
source: Enter your password
bn: আপনার পাসওয়ার্দ লিখুন
es: Ingrese su contraseña

# Placeholder_ExportPassword
source: Enter password to encrypt the export file
bn: এক্সপোর্ট ফাইল এনক্রিপ্ট করতে পাসওয়ার্ড লিখুন
es: Ingrese contraseña para cifrar el archivo exportado

# Placeholder_KeyFilePassword
source: Enter password for encrypted key file (leave empty if key is not encrypted)
bn: এনক্রিপ্ট করা কী ফাইলের জন্য পাসওয়ার্ড লিখুন (যদি কী এনক্রিপ্ট না হয় তবে খালি রাখুন)
es: Ingrese contraseña del archivo de clave (vacío si no está cifrado)

# Placeholder_ServerPassword
source: Enter your password (leave empty if using key file authentication)
bn: আপনার পাসওয়ার্ড লিখুন (যদি কী ফাইল প্রমাণীকরণ ব্যবহার করেন তবে খালি রাখুন)
es: Ingrese su contraseña (vacío si usa autenticación por clave)

# Terminal_Elevated
source: Elevated
bn: উচ্চতর
es: Elevado

# Terminal_Normal
source: Normal
bn: সাধারণ

# Terminal_ElevatedTooltip
source: Open terminal with administrator privileges
bn: প্রশাসক সুবিধা সহ টার্মিনাল খুলুন
es: Abrir terminal con privilegios de administrador

# Terminal_NormalTooltip
source: Open terminal with normal privileges
bn: সাধারণ সুবিধা সহ টার্মিনাল খুলুন
es: Abrir terminal con privilegios normales

# Export_Title
source: Export Servers
bn: সার্ভার এক্সপোর্ট
es: Exportar servidores

# Export_SelectServers
source: Select servers to export:
bn: এক্সপোর্ট করার জন্য সার্ভার নির্বাচন করুন:
es: Seleccione los servidores a exportar:

source: Export to file
bn: ফাইলে এক্সপোর্ট করুন
es: Exportar a archivo

# Import_Title
source: Import
bn: ইমপোর্ট
es: Importar

# Import_InvalidPassword
source: Invalid Password
bn: অবৈধ পাসওয়ার্ড
es: Contraseña inválida

# Login_Title
source: Login
bn: লগইন
es: Iniciar sesión

# Login_Username
source: Username:
bn: ব্যবহারকারীর নাম:
es: Usuario:

# Login_Password
source: Password:
bn: পাসওয়ার্ড:
es: Contraseña:

# Settings_Personalization
source: Personalization
bn: ব্যক্তিগতকরণের
es: Personalización

# Settings_Theme
source: Theme
bn: থিম
es: Tema

# Settings_Light
source: Light
bn: হালকা
es: Claro

# Settings_Dark
source: Dark
bn: গাঢ়
es: Oscuro

# Settings_DefaultShell
source: Default Shell
bn: ডিফল্ট শেল
es: Shell predeterminado

# Settings_Account
source: Account
bn: অ্যাকাউন্ট
es: Cuenta

# Settings_CloudSync
source: Cloud Sync
bn: ক্লাউড সিঙ্ক
es: Sincronización en la nube

# Settings_EnableCloudSync
source: Enable Cloud Sync
bn: ক্লাউড সিঙ্ক সক্ষম করুন
es: Habilitar sincronización en la nube

# Settings_AutoSyncStartup
source: Auto-sync on startup
bn: স্টার্টআপে অটো-সিঙ্ক
es: Sincronizar automáticamente al iniciar

# Settings_AutoSyncChanges
source: Auto-sync on changes
bn: পরিবর্তনে অটো-সিঙ্ক
es: Sincronizar automáticamente con cambios

# Settings_LastSync
source: Last sync: {0}
bn: শেষ সিঙ্ক: {0}
es: Última sincronización: {0}

# Settings_DeleteCloudData
source: Delete Cloud Data
bn: ক্লাউড ডেটা মুছুন
es: Eliminar datos en la nube

# Settings_About
source: About
bn: সম্পর্কিত
es: Acerca de

# Status_CancelledSSHTerminalUAC
source: SSH terminal was not opened (admin permission was declined).
bn: SSH টার্মিনাল খোলা হয়নি (প্রশাসক অনুমতি প্রত্যাখ্যাত হয়েছে)।
es: El terminal SSH no se abrió (permiso de administrador rechazado).

# App_DeveloperCredit
source: by Taufiq Abdur Rahman
bn: তৌফিক আবদুর রহমান কর্তৃক
es: por Taufiq Abdur Rahman

# Protocol_SSH_Description
source: SSH: Secure Shell for terminal access
bn: SSH: টার্মিনাল অ্যাক্সেসের জন্য নিরাপদ শেল
es: SSH: Shell seguro para acceso a terminal

# Protocol_FTP_Description
source: FTP: File Transfer Protocol
bn: FTP: ফাইল ট্রান্সফার প্রোটোকল
es: FTP: Protocolo de transferencia de archivos

# Protocol_SFTP_Description
source: SFTP: SSH File Transfer Protocol
bn: SFTP: SSH ফাইল ট্রান্সফার প্রোটোকল
es: SFTP: Protocolo de transferencia de archivos SSH

# Protocol_Description_Combined
source: SSH: Secure Shell for terminal access FTP: File Transfer Protocol SFTP: SSH File Transfer Protocol
bn: SSH: টার্মিনাল অ্যাক্সেসের জন্য নিরাপদ শেল FTP: ফাইল ট্রান্সফার প্রোটোকল SFTP: SSH ফাইল ট্রান্সফার প্রোটোকল
es: SSH: Shell seguro para acceso a terminal FTP: Protocolo de transferencia de archivos SFTP: Protocolo de transferencia de archivos SSH

# Validation_HostTooltip
source: Enter IP address (e.g., 192.168.1.100) or hostname (e.g., server.example.com)
bn: IP ঠিকানা (যেমন, 192.168.1.100) বা হোস্টনাম (যেমন, server.example.com) লিখুন
es: Ingrese dirección IP (ej. 192.168.1.100) o nombre de host (ej. servidor.ejemplo.com)

# Validation_PortTooltip
source: Enter port number (1-65535). Common ports: SSH=22, FTP=21, SFTP=22
bn: পোর্ট নম্বর লিখুন (1-65535)। সাধারণ পোর্ট: SSH=22, FTP=21, SFTP=22
es: Ingrese número de puerto (1-65535). Puertos comunes: SSH=22, FTP=21, SFTP=22

# Validation_ProtocolTooltip
source: Select the connection protocol
bn: সংযোগ প্রোটোকল নির্বাচন করুন
es: Seleccione el protocolo de conexión

# Validation_UsernameTooltip
source: Enter your username for the server
bn: সার্ভারের জন্য আপনার ব্যবহারকারীর নাম লিখুন
es: Ingrese su usuario del servidor

# Validation_PublicKeyTooltip
source: Path to your public key file (.pub)
bn: আপনার পাবলিক কী ফাইলের পাথ (.pub)
es: Ruta a su archivo de clave pública (.pub)

# Validation_PrivateKeyTooltip
source: Path to your private key file (.pem, .key)
bn: আপনার প্রাইভেট কী ফাইলের পাথ (.pem, .key)
es: Ruta a su archivo de clave privada (.pem, .key)

# FileFilter_ScratchShell
source: (*.ss)|*.ss|All Files (*.*)|*.*
bn: (*.ss)|*.ss|সব ফাইল (*.*)|*.*
es: (*.ss)|*.ss|Todos los archivos (*.*)|*.*

# FileFilter_PublicKey
source: Public Key Files (*.pub)|*.pub|All Files (*.*)|*.*
bn: পাবলিক কী ফাইল (*.pub)|*.pub|সব ফাইল (*.*)|*.*
es: Archivos de clave pública (*.pub)|*.pub|Todos los archivos (*.*)|*.*

# FileFilter_PrivateKey
source: Private Key Files (*.pem;*.key)|*.pem;*.key|All Files (*.*)|*.*
bn: প্রাইভেট কী ফাইল (*.pem;*.key)|*.pem;*.key|সব ফাইল (*.*)|*.*
es: Archivos de clave privada (*.pem;*.key)|*.pem;*.key|Todos los archivos (*.*)|*.*

# Dialog_Reconnect_ConnectionTimedOutTemplate
source: Connection to '{0}' ({1}:{2}) has timed out.
bn: '{0}' ({1}:{2}) এর সাথে সংযোগ টাইমআউট হয়েছে।
es: La conexión a '{0}' ({1}:{2}) ha superado el tiempo de espera.

# Dialog_Reconnect_Title
source: Connection Lost
bn: সংযোগ হারিয়ে গেছে
es: Conexión perdida

# Dialog_Reconnect_PrimaryButton
source: Reconnect
bn: পুনরায় সংযোগ
es: Reconectar

# Dialog_Reconnect_CloseButton
source: Close Tab
bn: ট্যাব বন্ধ করুন
es: Cerrar pestaña

# Dialog_Reconnect_Header
source: Connection Timeout
bn: সংযোগ টাইমআউট
es: Tiempo de espera de la conexión

# Dialog_Reconnect_DefaultInfo
source: Connection to server has timed out.
bn: সার্ভারের সাথে সংযোগ টাইমআউট হয়েছে।
es: La conexión con el servidor ha superado el tiempo de espera.

# Dialog_Reconnect_ErrorDetailsLabel
source: Error Details:
bn: ত্রুটির বিবরণ:
es: Detalles del error:

# Dialog_Reconnect_ErrorDetailsDefault
source: The connection has been lost due to network timeout or server unavailability.
bn: নেটওয়ার্ক টাইমআউট বা সার্ভার অনুপলব্ধতার কারণে সংযোগ হারিয়ে গেছে।
es: La conexión se perdió por tiempo de espera de red o indisponibilidad del servidor.

# Dialog_Reconnect_Question
source: What would you like to do?
bn: আপনি কী করতে চান?
es: ¿Qué desea hacer?

# Dialog_Reconnect_ActionReconnect
source: Reconnect
bn: পুনরায় সংযোগ
es: Reconectar

# Dialog_Reconnect_ActionReconnectDescription
source: Attempt to reconnect to the server and resume your session
bn: সার্ভারের সাথে পুনরায় সংযোগ করার চেষ্টা করুন এবং আপনার সেশন পুনরায় শুরু করুন
es: Intentar reconectar al servidor y reanudar la sesión

# Dialog_Reconnect_ActionClose
source: Close Tab
bn: ট্যাব বন্ধ করুন
es: Cerrar pestaña

# Dialog_Reconnect_ActionCloseDescription
source: Close this connection tab and return to the dashboard
bn: এই সংযোগ ট্যাব বন্ধ করুন এবং ড্যাশবোর্ডে ফিরে যান
es: Cerrar esta pestaña y volver al panel

# EventHandler_EditCancelled
source: Edit cancelled for: {0}
bn: সম্পাদনা বাতিল করা হয়েছে: {0}
es: Edición cancelada para: {0}

# EventHandler_BrowserEventsSetupSuccess
source: Browser events set up successfully
bn: ব্রাউজার ইভেন্ট সফলভাবে সেটআপ হয়েছে
es: Eventos del navegador configurados correctamente
