Repository: TaufiqOf/ScratchShell
Catalog: ScratchShell/Resources/Langauge.*.resx
Languages: bn, es

# EventHandler_BrowserEventsSetupError
source: Error setting up browser events
bn: ব্রাউজার ইভেন্ট সেটআপ ত্রুটি
es: Error configurando eventos del navegador

# EventHandler_SafeExecuteError
source: Error in safe execute
bn: নিরাপদ এক্সিকিউট ত্রুটি
es: Error en ejecución segura

# EventHandler_SafeExecuteAsyncError
source: Error in safe execute async
bn: নিরাপদ অ্যাসিঙ্ক এক্সিকিউট ত্রুটি
es: Error en ejecución segura asíncrona

# EventHandler_ExceptionIn
source: Exception in {0}
bn: {0} এ ব্যতিক্রম
es: Excepción en {0}

# EventHandler_CriticalErrorInExceptionHandler
source: Critical error in exception handler: {0}
bn: ব্যতিক্রম হ্যান্ডলারে জটিল ত্রুটি: {0}
es: Error crítico en el manejador de excepciones: {0}

# Terminal_UpdateError
source: Terminal update error: {0}
bn: টার্মিনাল আপডেট ত্রুটি: {0}
es: Error de actualización del terminal: {0}

# Critical_ErrorInDispose
source: Critical error in Dispose: {0} - {1}
bn: ডিসপোজে জটিল ত্রুটি: {0} - {1}
es: Error crítico en Dispose: {0} - {1}

# Connection_HandleTimeoutError
source: Error handling connection timeout
bn: সংযোগ টাইমআউট পরিচালনার ত্রুটি
es: Error al manejar el tiempo de espera de la conexión

# Connection_ErrorClosingTab
source: Error closing current tab
bn: বর্তমান ট্যাব বন্ধ করতে ত্রুটি
es: Error al cerrar la pestaña actual

# Connection_ErrorDuringControlLoad
source: Error during control load
bn: কন্ট্রোল লোড করার সময় ত্রুটি
es: Error durante la carga del control

# Settings_Language
source: Language
bn: ভাষা
es: Idioma

# Language_ChangeMessage
source: Please restart the application for the language change to take full effect.
bn: ভাষা পরিবর্তনের জন্য অ্যাপ্লিকেশন পুনরায় চালু করুন
es: Reinicie la aplicación para que el cambio de idioma surta efecto.

# Navigation_Home
source: Home
bn: হোম
es: Inicio

# Navigation_Session
source: Session
bn: সেশন
es: Sesión

# Navigation_Settings
source: Settings
bn: সেটিংস
es: Ajustes

# UI_Name
source: Name
bn: নাম
es: Nombre

# UI_Size
source: Size
bn: আকার
es: Tamaño

# UI_Type
source: Type
bn: ধরন
es: Tipo

# UI_Date
source: Date
bn: তারিখ
es: Fecha

# UI_DateModified
source: Date Modified
bn: পরিবর্তিত তারিখ
es: Fecha de modificación

# UI_SortAscending
source: Sort ascending (click to sort descending)
bn: क्रमबद्ध करें (छोटे से बड़े क्रम में सॉर्ट করার জন্য क्लिक करें)
es: Orden ascendente (clic para descendente)

# UI_SortDescending
source: Sort descending (click to sort ascending)
bn: क्रमबद्ध करें (बड़े से छोटे क्रम में सॉर्ट करने के लिए क्लिक करें)
es: Orden descendente (clic para ascendente)

source: Operation in progress...
bn: অপারেশন চলমান...
es: Operación en progreso...

# Operation_Cancelling
source: Cancelling operation...
bn: অপারেশন বাতিল করা হচ্ছে...
es: Cancelando operación...

# DragDrop_DropHere
source: Drop {0} '{1}' here to upload
bn: আপলোড করতে {0} '{1}' এখানে ছেড়ে দিন
es: Suelte {0} '{1}' aquí para subir

# DragDrop_FolderRecursive
source: Folder contents will be uploaded recursively
bn: ফোল্ডারের সামগ্রী পুনরাবৃত্তভাবে আপলোড করা হবে
es: El contenido de la carpeta se subirá recursivamente

# DragDrop_FileToDirectory
source: File will be uploaded to current directory
bn: বর্তমান ডিরেক্টরিতে ফাইল আপলোড করা হবে
es: El archivo se subirá al directorio actual

# DragDrop_DropMultiple
source: Drop {0} item(s) here to upload
bn: আপলোড করতে {0} আইটেম এখানে ছেড়ে দিন
es: Suelte {0} elemento(s) aquí para subir

# DragDrop_FilesAndFolders
source: {0} file(s) and {1} folder(s) will be uploaded
bn: {0} ফাইল এবং {1} ফোল্ডার আপলোড করা হবে
es: {0} archivo(s) y {1} carpeta(s) se subirán

# DragDrop_FoldersOnly
source: {0} folder(s) will be uploaded recursively
bn: {0} ফোল্ডার পুনরাবৃত্তভাবে আপলোড করা হবে
es: {0} carpeta(s) se subirán recursivamente

# DragDrop_FilesOnly
source: {0} file(s) will be uploaded
bn: {0} ফাইল আপলোড করা হবে
es: {0} archivo(s) se subirán

# UI_GridView
source: Grid View
bn: গ্রিড ভিউ
es: Vista de cuadrícula

# UI_ListView
source: List View
bn: লিস্ট ভিউ
es: Vista de lista

# UI_SortBy
source: Sort by:
bn: সাজান:
es: Ordenar por:

# UI_SortOptions
source: Sort options
bn: সাজানোর অপশন
es: Opciones de ordenación

# UI_ToggleSortDirection
source: Toggle sort direction
bn: সাজানোর দিক পরিবর্তন করুন
es: Cambiar dirección de ordenación

# UI_SortNameAZ
source: Name (A to Z)
bn: নাম (ক থেকে য)
es: Nombre (A a Z)

# UI_SortNameZA
source: Name (Z to A)
bn: নাম (য থেকে ক)
es: Nombre (Z a A)

# UI_SortSizeSmallest
source: Size (Smallest first)
bn: আকার (ছোট আগে)
es: Tamaño (Más pequeño primero)

# UI_SortSizeLargest
source: Size (Largest first)
bn: আকার (বড় আগে)
es: Tamaño (Más grande primero)

# UI_SortTypeAZ
source: Type (A to Z)
bn: ধরন (ক থেকে য)
es: Tipo (A a Z)

# UI_SortTypeZA
source: Type (Z to A)
bn: ধরন (য থেকে ক)
es: Tipo (Z a A)

# UI_SortDateOldest
source: Date (Oldest first)
bn: তারিখ (পুরনো আগে)
es: Fecha (Más antiguo primero)

# UI_SortDateNewest
source: Date (Newest first)
bn: তারিখ (নতুন আগে)
es: Fecha (Más reciente primero)

# UI_CancelOperation
source: Cancel current operation
bn: বর্তমান অপারেশন বাতিল করুন
es: Cancelar operación actual

# UI_DragDropDefault
source: Drop files and folders here to upload
bn: আপলোড করতে ফাইল ও ফোল্ডার এখানে ছেড়ে দিন
es: Suelte archivos y carpetas aquí para subir

# UI_DragDropSupport
source: Multiple files and folders are supported
bn: একাধিক ফাইল ও ফোল্ডার সাপোর্ট করা হয়
es: Se admiten múltiples archivos y carpetas

# Tooltip_Back
source: Back (Alt+Left Arrow)
bn: পেছনে (Alt+Left Arrow)
es: Atrás (Alt+Flecha izquierda)

# Tooltip_Forward
source: Forward (Alt+Right Arrow)
bn: এগিয়ে (Alt+Right Arrow)
es: Adelante (Alt+Flecha derecha)

# Tooltip_Refresh
source: Refresh (F5)
bn: রিফ্রেশ (F5)
es: Actualizar (F5)

# Tooltip_UpOneLevel
source: Up one level
bn: এক স্তর উপরে
es: Subir un nivel

# Tooltip_CreateNewFolder
source: Create new folder
bn: নতুন ফোল্ডার তৈরি করুন
es: Crear nueva carpeta

# Tooltip_Paste
source: Paste (Ctrl+V)
bn: পেস্ট (Ctrl+V)
es: Pegar (Ctrl+V)

# Tooltip_ViewOptions
source: View options
bn: দেখার অপশন
es: Opciones de vista

# Tooltip_FullScreenMode
source: Full screen mode
bn: ফুল স্ক্রিন মোড
es: Modo pantalla completa

# Tooltip_ShowHideLogPanel
source: Show/hide log panel
bn: লগ প্যানেল দেখান/লুকান
es: Mostrar/ocultar panel de registros

# UI_OperationLog
source: Operation Log
bn: অপারেশন লগ
es: Registro de operaciones

# Tooltip_CopyFromTerminal
source: Copy selected text from terminal (Ctrl+Left Click)
bn: টার্মিনাল থেকে নির্বাচিত টেক্সট কপি করুন (Ctrl+Left Click)
es: Copiar texto seleccionado del terminal (Ctrl+Click izq.)

# Tooltip_PasteToTerminal
source: Paste text into terminal (Alt+Left Click)
bn: টার্মিনালে টেক্সট পেস্ট করুন (Alt+Left Click)
es: Pegar texto en el terminal (Alt+Click izq.)

# Tooltip_ShowHideSnippets
source: Show/hide command snippets panel
bn: কমান্ড স্নিপেট প্যানেল দেখান/লুকান
es: Mostrar/ocultar panel de fragmentos

# Tooltip_ShowHideThemes
source: Show/hide theming panel
bn: থিমিং প্যানেল দেখান/লুকান
es: Mostrar/ocultar panel de temas

# Tooltip_ToggleFullScreenTerminal
source: Toggle full screen mode for terminal
bn: টার্মিনালের জন্য ফুল স্ক্রিন মোড টগল করুন
es: Alternar modo pantalla completa del terminal

# ContextMenu_SelectAll
source: Select All
bn: সব নির্বাচন করুন
es: Seleccionar todo

# Terminal_ConnectingTo
source: Connecting to {0}...
bn: {0} এর সাথে সংযোগ করা হচ্ছে...
es: Conectando a {0}...

# Terminal_ConnectionFailed
source: Failed to connect to {0}: {1}
bn: {0} এর সাথে সংযোগ ব্যর্থ: {1}
es: Error al conectar a {0}: {1}

# Terminal_ServerNotInitialized
source: Server is not initialized.
bn: সার্ভার ইনিশিয়ালাইজ করা হয়নি।
es: El servidor no está inicializado.

# Terminal_ResizeFailed
source: Failed to resize terminal: {0}
bn: টার্মিনাল রিসাইজ ব্যর্থ: {0}
es: Error al redimensionar el terminal: {0}

# Terminal_Error
source: Error: {0}
bn: ত্রুটি: {0}

# Terminal_AutoCompleteError
source: AutoComplete error: {0}
bn: অটোকমপ্লিট ত্রুটি: {0}
es: Error de autocompletar: {0}

# Tooltip_CreateSnippet
source: Create a new snippet
bn: নতুন স্নিপেট তৈরি করুন
es: Crear nuevo fragmento

# Tooltip_EditSnippet
source: Edit selected snippet
bn: নির্বাচিত স্নিপেট সম্পাদনা করুন
es: Editar fragmento seleccionado

# Tooltip_DeleteSnippet
source: Delete selected snippet
bn: নির্বাচিত স্নিপেট মুছে ফেলুন
es: Eliminar fragmento seleccionado

# Tooltip_ShowHideSystemSnippets
source: Show/Hide System Snippet
bn: সিস্টেম স্নিপেট দেখান/লুকান
es: Mostrar/ocultar fragmentos del sistema

# Tooltip_RunSnippet
source: Run this snippet in the terminal
bn: এই স্নিপেট টার্মিনালে চালান
es: Ejecutar este fragmento en el terminal

# Placeholder_SearchSnippets
source: Search snippets...
bn: স্নিপেট খুঁজুন...
es: Buscar fragmentos...

# Theme_TerminalTheme
source: Terminal Theme
bn: টার্মিনাল থিম
es: Tema del terminal

# Theme_Apply
source: Apply
bn: প্রয়োগ করুন
es: Aplicar

# Theme_PredefinedThemes
source: Predefined Themes:
bn: পূর্বনির্ধারিত থিম:
es: Temas predefinidos:

# Theme_Dark
source: Dark
bn: গাঢ়
es: Oscuro

# Theme_Light
source: Light
bn: হালকা
es: Claro

# Theme_Monokai
source: Monokai
bn: মোনোকাই

# Theme_Reset
source: Reset
bn: রিসেট
es: Restablecer

# Theme_FontSettings
source: Font Settings
bn: ফন্ট সেটিংস
es: Configuración de fuente

# Theme_FontFamily
source: Family:
bn: পরিবার:
es: Familia:

# Theme_FontSize
source: Size:
bn: আকার:
es: Tamaño:

# Theme_ColorSettings
source: Color Settings
bn: রং সেটিংস
es: Configuración de color

# Theme_ColorEditing
source: Editing:
bn: সম্পাদনা:
es: Editando:

# Theme_TextColor
source: Text Color
bn: টেক্সট রং
es: Color de texto

# Theme_BackgroundColor
source: Background Color
bn: ব্যাকগ্রাউন্ড রং
es: Color de fondo

# Theme_SelectionColor
source: Selection Color
bn: নির্বাচন রং
es: Color de selección

# Theme_CursorColor
source: Cursor Color
bn: কার্সার রঙ
es: Color del cursor

# Theme_CopyHighlightColor
source: Copy Highlight Color
bn: কপি হাইলাইট রং
es: Color de resaltado de copia

# Theme_Text
source: Text
bn: টেক্সট
es: Texto

# Theme_Background
source: Background
bn: ব্যাকগ্রাউন্ড
es: Fondo

# Theme_Selection
source: Selection
bn: নির্বাচন
es: Selección

# Theme_Cursor
source: Cursor
bn: কার্সার

# Theme_Copy
source: Copy
bn: কপি
es: Copiar

# Theme_TerminalPresets
source: Terminal Presets:
bn: টার্মিনাল প্রিসেট:
es: Preajustes del terminal:

# Tooltip_PreviewDarkTheme
source: Preview dark theme
bn: গাঢের থিম প্রিভিউ করুন
es: Vista previa tema oscuro

# Tooltip_PreviewLightTheme
source: Preview light theme
bn: হালকা থিম প্রিভিউ করুন
es: Vista previa tema claro

# Tooltip_PreviewMonokaiTheme
source: Preview Monokai theme
bn: মোনোকাই থিম প্রিভিউ করুন
es: Vista previa tema Monokai

# Tooltip_ResetTheme
source: Reset theme to default values
bn: থিম ডিফল্ট মানে রিসেট করুন
es: Restablecer tema a valores predeterminados

# Settings_Restart
source: Restart
bn: রিস্টার্ট

# Language_Spanish
source: Spanish
es: Español
